---
kind: method
id: M:Autodesk.Revit.DB.LinkOperations.Dispose
source: html/d0bac7ec-9bd1-cf20-6ffa-096eb010d622.htm
---
# Autodesk.Revit.DB.LinkOperations.Dispose Method

Releases all resources used by the LinkOperations

## Syntax (C#)
```csharp
public void Dispose()
```